#include <string>
#include <vector>

using namespace std;

int solution(int n) {
    vector<int> dp(n+1, 0);
    dp[0] = 1;
    dp[1] = 1;
    dp[2] = 2;
    dp[3] = 5;
    
    for(int i = 4; i <= n; i++) {
        for(int j = 0; j < i; j++) {
            dp[i] += dp[j] * dp[i-j-1];
        }
    }
    return dp[n];
}

// dp[0] = 0
// dp[1] = 1; ()
// dp[2] = 2;  (()), ()()
// dp[3] = 5
// 1. 새로 감싸기
// ((())), (()())
// 2. 양끝에 붙이기
// ()(()), (())() ()()()

// dp[4] = ?
// 1. (((()))), ((()())), (()(())), ((())()) (()()())
// 2. ()((())), ((()))(), 
// ()(()()), (()())(), 
// ()()(()), (())(()), ()(()()), ()(()())
